[
  {
    "id": 1,
    "sinhala": "ජීවිතයේ හැම දේකටම සිතයි මුල්වෙන්නේ. සිතම තමයි ශ්‍රේෂ්ඨ වෙන්නේ. සිතින්මයි හටගන්නේ. යම් හෙයකින් සිත නරක් කරගෙන යමක් කිව්වොත් හරි, යමක් කෙරුවොත් හරි, ඒකෙන් ලැබෙන දුක් විපාක ඔහුගේ පස්සෙන් ලුහුබඳිනවා. කරත්තේ බැඳලා ඉන්න ගොනාගෙ පස්සෙන් එන රෝදයක් වගෙයි",
    "english": "Mind is the forerunner of all states. Mind is their chief; they are mind-made. If one speaks or acts with an impure mind, suffering follows him, as the wheel follows the foot of the ox that draws the cart."
  },
  {
    "id": 2,
    "sinhala": "ජීවිතයේ හැම දේකටම සිතයි මුල්වෙන්නේ. සිතම තමයි ශ්‍රේෂ්ඨ වෙන්නේ. සිතින්මයි හටගන්නේ. යම් හෙයකින් යහපත් සිතින් යමක් කිව්වොත් හරි, යමක් කෙරුවොත් හරි, ඒකෙන් ලැබෙන සැප විපාක ඔහුගේ පස්සෙන්ම එනවා. තමාව අත්නොහරින හෙවනැල්ලක් වගෙයි",
    "english": "Mind is the forerunner of all states. Mind is their chief; they are mind-made. If one speaks or acts with a pure mind, happiness follows him, like a shadow that never leaves."
  },
  {
    "id": 3,
    "sinhala": "අසවල් කෙනා මට බැන්නා, මට පහර දුන්නා. මාව පරාජය කළා, මගේ දේ පැහැරගත්තා කිය කියා හිතන්ට ගිහින්, යම් කෙනෙක් ක්‍රෝධයෙන් බැඳිල ගියොත්, ඒ උදවියගේ වෛරය නම් සංසිඳෙන්නේ නෑ.",
    "english": "He abused me, he struck me, he defeated me, he robbed me, in those who harbor such thoughts, hatred is not appeased."
  },
  {
    "id": 4,
    "sinhala": "අසවල් කෙනා මට බැන්නා, මට පහර දුන්නා. මාව පරාජය කළා, මගේ දේ පැහැරගත්තා කිය කියා නොසිතා, යම් කෙනෙක් ක්‍රෝධයක් ඇතිකරගන්නෙ නැත්නම්, ඒ උදවියගේ වෛරය සංසිඳිලා යනවා.",
    "english": "He abused me, he struck me, he defeated me, he robbed me, in those who do not harbor such thoughts, hatred is appeased."
  },
  {
    "id": 5,
    "sinhala": "මේ ලෝකයේ කවරදාවත් වෛර කිරීමෙන් නම් වෛරය සංසිඳෙන්නේ නෑ. වෛර නොකිරීමෙන් ම යි වෛරය සංසිඳෙන්නේ. මේක මේ ලෝකයේ තිබෙන සනාතන ධර්මයක්.",
    "english": "Hatred is never appeased by hatred in this world. By non-hatred alone is hatred appeased. This is an eternal law."
  },
  {
    "id": 6,
    "sinhala": "මේ විදිහට කෝලාහල කරගන්ට ගියොත්, අපි ම යි විනාශ වෙන්නේ කියල මේ කෝලාහල කරන උදවිය දන්නෙ නෑ. නමුත් මේ කෝලාහල වලින් වැනසෙන්නෙ අපි ම යි කියල යම් කෙනෙක් දන්නවා නම්, ඒ තුළින් ම යි කෝලාහල සංසිඳෙන්නේ.",
    "english": "Others do not understand that we must perish here; but those who understand this, their quarrels cease at once"
  }
]