[
  {
    "id": 1,
    "sinhala": "සියලු දෙවියන්ගේ නායකයා විසින් පෙරටුගන්නා ලදි. සියලු දෙවියන්ගේ ප්‍රධානත්වය සිතෙහි පිහිටා ඇත්තේය.",
    "english": "Mind is the forerunner of all actions. All deeds are led by mind, created by mind."
  },
  {
    "id": 2,
    "sinhala": "අප්‍රමාදය අමරණීය මාර්ගයයි. ප්‍රමාදය මරණීය මාර්ගයයි.",
    "english": "Heedfulness is the path to the Deathless. Heedlessness is the path to death."
  },
  {
    "id": 3,
    "sinhala": "වෛරය කිසිදා වෛරයෙන් සන්සිඳෙන්නේ නැත. අවෛරයෙන් පමණක් සන්සිඳේ. මෙය සනාතන ධර්මයයි.",
    "english": "Hatred is never appeased by hatred. By non-hatred alone is hatred appeased. This is an eternal law."
  },
  {
    "id": 4,
    "sinhala": "යමක් කළ යුතු වේද, එය ස්ථිරාසන්නව කළ යුතුය. ශිථිල පාරමිතාව දුක් වඩන්නීය.",
    "english": "Whatever is to be done, do it with all your might. A lax effort only scatters more dust."
  },
  {
    "id": 5,
    "sinhala": "හොඳින් කියන ලද වචන ඵල නොදෙන්නේ ක්‍රියාවට නොපත්වන්නේ නම් පමණි.",
    "english": "Well-spoken words bear no fruit in one who does not practice them."
  },
  {
    "id": 6,
    "sinhala": "අප්‍රමත්තව ජීවත්වන්නේ ප්‍රමත්තයන් අතර අප්‍රමත්තයා දීප්තිමත් වේ.",
    "english": "Among the heedless, the vigilant one shines like a beacon fire."
  },
  {
    "id": 7,
    "sinhala": "ඔබේ ගැලවීමට ඔබම වෙහෙසක් දැරිය යුතුය. තථාගතයෝ මග පෙන්වන්නවුන් පමණි.",
    "english": "You yourself must make an effort. Buddhas only point the way."
  },
  {
    "id": 8,
    "sinhala": "පාපයෙන් වැළකී සිටින්න. යහපත් වඩන්න. සිත පිරිසිදු කරන්න. මෙය බුදුන්ගේ ඉගැන්වීමයි.",
    "english": "Cease to do evil, cultivate the good, purify the mind. This is the teaching of the Buddhas."
  },
  {
    "id": 9,
    "sinhala": "ශාන්තිය සොයන්නේ ඔබ තුළයි. වෙන තැනක එය සොයන්නේ නැත.",
    "english": "Peace comes from within. Do not seek it without."
  },
  {
    "id": 10,
    "sinhala": "සෞඛ්‍යය විශිෂ්ඨම ලාභයයි. සන්තෝෂය විශිෂ්ඨම ධනයයි.",
    "english": "Health is the greatest gift, contentment the greatest wealth."
  },
  {
    "id": 11,
    "sinhala": "කෝපය සුදුසු නොවේ ම විට නොකෝප වීම වඩාත් දුෂ්කර ජයග්‍රහණයකි.",
    "english": "The greatest conquest is not anger when anger is justified."
  },
  {
    "id": 12,
    "sinhala": "සෑම දෙයක්ම සිතින් නිර්මිත වේ. සිත පිරිසිදු නම් සතුට ඔබව සෙවණැලි මෙන් අනුගමනය කරයි.",
    "english": "All that we are arises with our thoughts. With pure thoughts, happiness follows like a shadow."
  },
  {
    "id": 13,
    "sinhala": "සැබෑ ජයග්‍රහණය තමන්ව ජය ගැනීමයි.",
    "english": "One's own self conquered is better than all other conquests."
  },
  {
    "id": 14,
    "sinhala": "ක්‍රෝධය අත්හැර දමන්න. අහංකාරය අත්හැර දමන්න. සියලු බැඳීම් ඉක්මවා යන්න.",
    "english": "Abandon anger, give up pride, overcome all bondage."
  },
  {
    "id": 15,
    "sinhala": "නුවණැත්තා මේ ලෝකයේ සහ ඊළඟ ලෝකයේ සැමට හිතකර වන බව කරති.",
    "english": "The wise do what is beneficial for themselves and others, in this world and the next."
  }
]
