[
  {
    "id": 1,
    "title": "International Vesak Day Celebrations Announced",
    "titleSinhala": "ජාත්‍යන්තර වෙසක් දින සැමරුම් ප්‍රකාශයට පත් කරයි",
    "excerpt": "The United Nations announces global Vesak Day celebrations to commemorate the birth, enlightenment, and passing of the Buddha.",
    "excerptSinhala": "බුදුන්ගේ උපත, බුද්ධත්වය සහ මහා පරිනිර්වාණය සැමරීම සඳහා එක්සත් ජාතීන්ගේ සංවිධානය ලොව පුරා වෙසක් දින සැමරීම් ප්‍රකාශයට පත් කරයි.",
    "content": "The United Nations has announced that Vesak Day will be celebrated globally with special ceremonies and events. Buddhist leaders from around the world will gather to commemorate this sacred day. The celebration will include meditation sessions, Dharma talks, and cultural programs showcasing Buddhist traditions from various countries.",
    "contentSinhala": "එක්සත් ජාතීන්ගේ සංවිධානය විසින් වෙසක් දිනය විශේෂ උත්සව හා සිදුවීම් සමඟ ලොව පුරා සමරනු ලබන බව ප්‍රකාශ කර ඇත. මෙම පූජනීය දිනය සැමරීම සඳහා ලොව පුරා සිට බෞද්ධ නායකයින් එක්රැස් වනු ඇත.",
    "source": "Buddhist International",
    "author": "Dharma News Network",
    "date": "2025-11-15",
    "category": "Events",
    "tags": [
      "Vesak",
      "UN",
      "Celebration",
      "Global"
    ],
    "image": "/logo.png",
    "url": "https://www.un.org/en/observances/vesak-day",
    "featured": true,
    "language": "English",
    "hidden": true
  },
  {
    "id": 2,
    "title": "New Buddhist University Opens in Sri Lanka",
    "titleSinhala": "ශ්‍රී ලංකාවේ නව බෞද්ධ විශ්වවිද්‍යාලයක් විවෘත වේ",
    "excerpt": "A new center for Buddhist studies and meditation opens its doors in Kandy, offering traditional and modern Buddhist education.",
    "excerptSinhala": "සම්ප්‍රදායික සහ නවීන බෞද්ධ අධ්‍යාපනය පිරිනමන බෞද්ධ අධ්‍යයන සහ භාවනා සඳහා නව මධ්‍යස්ථානයක් මහනුවරදී විවෘත කෙරේ.",
    "content": "The new International Buddhist University has officially opened in Kandy, Sri Lanka. The institution will offer comprehensive programs in Buddhist philosophy, meditation practices, Pali language, and comparative religious studies. Renowned Buddhist scholars from Asia and the West will serve as faculty members.",
    "contentSinhala": "නව ජාත්‍යන්තර බෞද්ධ විශ්වවිද්‍යාලය ශ්‍රී ලංකාවේ මහනුවර නගරයේ නිල වශයෙන් විවෘත කර ඇත. මෙම ආයතනය බෞද්ධ දර්ශනය, භාවනා ක්‍රම, පාලි භාෂාව සහ සංසන්දනාත්මක ආගමික අධ්‍යයන පිළිබඳ විස්තීර්ණ වැඩසටහන් ඉදිරිපත් කරනු ඇත.",
    "source": "Sri Lanka Buddhist News",
    "author": "Sangha Press",
    "date": "2025-11-12",
    "category": "Education",
    "tags": [
      "University",
      "Sri Lanka",
      "Education",
      "Meditation"
    ],
    "image": "/logo.png",
    "url": "https://www.buddhism.org",
    "featured": true,
    "language": "English",
    "hidden": true
  },
  {
    "id": 3,
    "title": "Mindfulness Programs Expand in European Schools",
    "titleSinhala": "යුරෝපීය පාසල්වල සිහිය වැඩසටහන් පුළුල් වේ",
    "excerpt": "Buddhist mindfulness and meditation programs are being integrated into school curricula across several European countries.",
    "excerptSinhala": "බෞද්ධ සිහිය සහ භාවනා වැඩසටහන් යුරෝපීය රටවල් කිහිපයක පාසල් විෂයමාලාවට ඒකාබද්ධ කෙරේ.",
    "content": "Several European countries including the UK, Germany, and the Netherlands are incorporating Buddhist mindfulness practices into their school systems. Research has shown significant improvements in student focus, emotional regulation, and academic performance. The programs teach simple breathing exercises and awareness practices adapted from traditional Buddhist meditation.",
    "contentSinhala": "එක්සත් රාජධානිය, ජර්මනිය සහ නෙදර්ලන්තය ඇතුළු යුරෝපීය රටවල් කිහිපයක් ඔවුන්ගේ පාසල් පද්ධතිවලට බෞද්ධ සිහිය භාවිතයන් ඒකාබද්ධ කරමින් සිටී.",
    "source": "European Education Journal",
    "author": "Dr. Emma Williams",
    "date": "2025-11-10",
    "category": "Mindfulness",
    "tags": [
      "Education",
      "Mindfulness",
      "Europe",
      "Youth"
    ],
    "image": "/logo.png",
    "url": "https://www.mindful.org/mindfulness-in-education",
    "featured": false,
    "language": "English",
    "hidden": true
  },
  {
    "id": 4,
    "title": "Ancient Buddhist Texts Digitized and Made Available Online",
    "titleSinhala": "පුරාණ බෞද්ධ ග්‍රන්ථ ඩිජිටල් කර අන්තර්ජාලය හරහා ලබා ගත හැකිය",
    "excerpt": "A major digitization project makes thousands of ancient Buddhist manuscripts accessible to researchers and practitioners worldwide.",
    "excerptSinhala": "විශාල ඩිජිටල්කරණ ව්‍යාපෘතියක් ලොව පුරා පර්යේෂකයන්ට සහ භාවනා කරන්නන්ට පුරාණ බෞද්ධ අත්පිටපත් දහස් ගණනක් ප්‍රවේශ විය හැකි කරයි.",
    "content": "The Buddhist Digital Library Project has successfully digitized over 50,000 ancient manuscripts from monasteries across Asia. These include rare Pali, Sanskrit, Tibetan, and Chinese texts, some dating back over 1,000 years. The collection is now freely available online with searchable translations in multiple languages.",
    "contentSinhala": "බෞද්ධ ඩිජිටල් පුස්තකාල ව්‍යාපෘතිය ආසියාව පුරා පිහිටි විහාරස්ථානවලින් පුරාණ අත්පිටපත් 50,000 කට වඩා සාර්ථකව ඩිජිටල් කර ඇත.",
    "source": "Buddhist Heritage Foundation",
    "author": "Venerable Kusala",
    "date": "2025-11-08",
    "category": "Technology",
    "tags": [
      "Digital",
      "Manuscripts",
      "Preservation",
      "Technology"
    ],
    "image": "/logo.png",
    "url": "https://www.buddhism.org/digital-library",
    "featured": false,
    "language": "English",
    "hidden": true
  },
  {
    "id": 5,
    "title": "Buddhist Climate Action Summit Concludes Successfully",
    "titleSinhala": "බෞද්ධ දේශගුණ ක්‍රියාකාරී සමුළුව සාර්ථකව අවසන් වේ",
    "excerpt": "Buddhist leaders worldwide commit to environmental action and sustainable practices based on Buddhist principles.",
    "excerptSinhala": "ලොව පුරා බෞද්ධ නායකයන් බෞද්ධ මූලධර්ම මත පදනම්ව පාරිසරික ක්‍රියාමාර්ග සහ තිරසාර භාවිතයන් සඳහා කැපවෙති.",
    "content": "The International Buddhist Climate Action Summit brought together 300 Buddhist leaders, monks, and environmental activists from 45 countries. Participants drafted a declaration emphasizing Buddhist teachings on interdependence, compassion, and mindful consumption as foundations for addressing climate change. Major monasteries pledged to implement renewable energy and zero-waste practices.",
    "contentSinhala": "ජාත්‍යන්තර බෞද්ධ දේශගුණ ක්‍රියාකාරී සමුළුව රටවල් 45 කින් බෞද්ධ නායකයින්, භික්ෂූන් සහ පරිසර ක්‍රියාකාරීන් 300 ක් එක්රැස් කළේය.",
    "source": "Green Dharma Initiative",
    "author": "Bhikkhu Bodhi",
    "date": "2025-11-05",
    "category": "Environment",
    "tags": [
      "Climate",
      "Environment",
      "Sustainability",
      "Action"
    ],
    "image": "/logo.png",
    "url": "https://www.greendharmainitiative.org",
    "featured": true,
    "language": "English",
    "hidden": true
  },
  {
    "id": 6,
    "title": "Buddhism and Modern Science Conference Announced",
    "titleSinhala": "බුද්ධාගම සහ නවීන විද්‍යා සම්මන්ත්‍රණය ප්‍රකාශයට පත් කෙරේ",
    "excerpt": "Leading scientists and Buddhist scholars to explore connections between Buddhist philosophy and quantum physics.",
    "excerptSinhala": "ප්‍රමුඛ විද්‍යාඥයින් සහ බෞද්ධ විශාරදයින් බෞද්ධ දර්ශනය සහ ක්වොන්ටම් භෞතික විද්‍යාව අතර සම්බන්ධතා ගවේෂණය කරයි.",
    "content": "The annual Buddhism and Modern Science Conference will take place in December, featuring dialogues between Nobel Prize-winning physicists and senior Buddhist teachers. Topics include consciousness studies, the nature of reality, and the convergence of contemplative practice and neuroscience. The event will be livestreamed globally.",
    "contentSinhala": "වාර්ෂික බුද්ධාගම සහ නවීන විද්‍යා සම්මන්ත්‍රණය දෙසැම්බර් මාසයේ පැවැත්වීමට නියමිතය.",
    "source": "Mind & Life Institute",
    "author": "Dr. Sarah Chen",
    "date": "2025-11-03",
    "category": "Science",
    "tags": [
      "Science",
      "Conference",
      "Consciousness",
      "Research"
    ],
    "image": "/logo.png",
    "url": "https://www.mindandlife.org",
    "featured": false,
    "language": "English",
    "hidden": true
  },
  {
    "id": 7,
    "title": "සිංහල බෞද්ධ සාහිත්‍යය සඳහා නව සම්මානයක්",
    "titleSinhala": "සිංහල බෞද්ධ සාහිත්‍යය සඳහා නව සම්මානයක්",
    "excerpt": "සිංහල භාෂාවෙන් බෞද්ධ සාහිත්‍යය ප්‍රවර්ධනය කිරීම සඳහා නව සම්මාන යෝජනා ක්‍රමයක් ආරම්භ කෙරේ.",
    "excerptSinhala": "සිංහල භාෂාවෙන් බෞද්ධ සාහිත්‍යය ප්‍රවර්ධනය කිරීම සඳහා නව සම්මාන යෝජනා ක්‍රමයක් ආරම්භ කෙරේ.",
    "content": "The Sri Lanka Buddhist Literary Foundation announces a new annual award to recognize outstanding contributions to Buddhist literature in Sinhala. The award aims to encourage writers, poets, and scholars to produce high-quality Dharma content in Sinhala language, making Buddhist teachings more accessible to Sinhala-speaking communities worldwide.",
    "contentSinhala": "ශ්‍රී ලංකා බෞද්ධ සාහිත්‍ය පදනම සිංහල බෞද්ධ සාහිත්‍යයට කැපී පෙනෙන දායකත්වය හඳුනා ගැනීම සඳහා නව වාර්ෂික සම්මානයක් ප්‍රකාශයට පත් කරයි.",
    "source": "ලංකා බෞද්ධ පුවත්",
    "author": "සංඝරත්න හිමි",
    "date": "2025-11-01",
    "category": "Literature",
    "tags": [
      "Sinhala",
      "Literature",
      "Award",
      "Sri Lanka"
    ],
    "image": "/logo.png",
    "url": "https://www.buddhism.lk",
    "featured": false,
    "language": "සිංහල",
    "hidden": true
  },
  {
    "id": 8,
    "title": "Global Meditation Day Brings Together Millions",
    "titleSinhala": "ගෝලීය භාවනා දිනය මිලියන ගණනක් එකතු කරයි",
    "excerpt": "Buddhists and meditation practitioners around the world unite for a day of collective practice and peace.",
    "excerptSinhala": "ලොව පුරා බෞද්ධයන් සහ භාවනා කරන්නන් සාමුහික භාවිතයක් සහ සාමය සඳහා එක්වෙති.",
    "content": "Over 5 million people from 120 countries participated in Global Meditation Day, a synchronized meditation event promoting peace and mindfulness. Participants meditated for world peace at the same time across different time zones. The event demonstrated the growing global interest in Buddhist meditation practices.",
    "contentSinhala": "රටවල් 120 කින් මිලියන 5 කට අධික පිරිසක් ගෝලීය භාවනා දිනයට සහභාගී වූහ.",
    "source": "World Peace Foundation",
    "author": "Ajahn Brahm",
    "date": "2025-10-28",
    "category": "Meditation",
    "tags": [
      "Meditation",
      "Global",
      "Peace",
      "Mindfulness"
    ],
    "image": "/logo.png",
    "url": "https://www.worldpeace.org",
    "featured": false,
    "language": "English",
    "hidden": true
  }
]